#pragma once
#ifdef __cplusplus
extern "C" {
#endif

#include "types.h"

#ifdef DRIVER_XXX
#	ifndef UNICODE
#		define UNICODE
#		define _UNICODE
#	endif
#endif

#ifdef DBG
#define BPX __asm int 3;
#else
#define BPX 
#endif

// {ABCCCED3-A852-4beb-9D49-0D0E76F6E64D}
//static const GUID g_guidApplicaRegistryInformation = 
//{ 0xabccced3, 0xa852, 0x4beb, { 0x9d, 0x49, 0xd, 0xe, 0x76, 0xf6, 0xe6, 0x4d } };

#define APPLICA_GUID_A    "{ABCCCED3-A852-4beb-9D49-0D0E76F6E64D}"
#define APPLICA_GUID_T _T(APPLICA_GUID_A)

// ***** Base registry key: *************************************************************

#define HKLM_CONTROL_REG_KEY_	"SYSTEM\\CurrentControlSet\\Control\\"

// SYSTEM\CurrentControlSet\Control\{ABCCCED3-A852-4beb-9D49-0D0E76F6E64D}
#define HKLM_INFO_REG_KEY_T _T(HKLM_CONTROL_REG_KEY_) APPLICA_GUID_T
// In the param SYSTEM\CurrentControlSet\Control\{ABCCCED3-A852-4beb-9D49-0D0E76F6E64D}
// DoHookAffinity (DWORD) we save 1 if the necessary to hook set affinity functions
#define APPLICA_APPLICA_REG_INFO_REG_KEY_T  _T("\\Registry\\Machine\\") HKLM_INFO_REG_KEY_T
#define HKLM_APPLICA_REG_INFO_REG_KEY_T  HKLM_INFO_REG_KEY_T

// Indicate if need to Hook affinity mask 
#define APPLICA_PARAM_DOHOOKAFFINITY_T _T("DoHookAffinity")
//#define REG_INFO_REG_KEY_W  _W("\\Registry\\Machine\\") _W(HKLM_INFO_REG_KEY_BASE) APPLICA_GUID_W

#define REG_BASE_REG_VALUE_T	_T("ProductBaseRegKey")


	APPLICA_DISPLAY_RAGEIIC,
	APPLICA_DISPLAY_SIS,
}
APPLICA_DISPLAY_ID, *PAPPLICA_DISPLAY_ID;

typedef enum _APPLICA_KEYBOARD_ID
{
	APPLICA_KEYBOARD_NONE,
	APPLICA_KEYBOARD_XT,
	APPLICA_KEYBOARD_AT
}
APPLICA_KEYBOARD_ID, *PAPPLICA_KEYBOARD_ID;

typedef enum _APPLICA_POINTER_ID
{
	APPLICA_POINTER_NONE,
	APPLICA_POINTER_PS2,
	APPLICA_POINTER_SERIAL_2B,
	APPLICA_POINTER_SERIAL_3B,
	APPLICA_POINTER_SERIAL_WHEEL,
	APPLICA_POINTER_SERIAL_BALLPOINT
}
APPLICA_POINTER_ID, *PAPPLICA_POINTER_ID;


#define	DEFAULT_PROCESSOR_AFFINITY	0x00000000
#define	SINGLE_PROCESSOR_AFFINITY	0x00000001
#define	MULTIPLE_PROCESSOR_AFFINITY	0xFFFFFFFF

//
// Define the public device name strings.
//

#ifndef NO_SPECIALIZED_PROTECTION
#include "Product.h"
#endif

#if APPLICA_PRODUCT==PRODUCT_APPLIDEV
#	define DEVICE_PREFIX	L"Applica"
//#	define FILE_PREFIX		L"Applica"
//#	define FILE_PREFIX2		L"ApplicaXP"
//#	define FILE_PREFIX3		L"Ap"
#else
#	define DEVICE_PREFIX	L"Multixp"
//#	define FILE_PREFIX		L"Multixp"
//#	define FILE_PREFIX2		L"Multixp"
//#	define FILE_PREFIX3		L"Multixp"
#endif

#define APPLICA_HOST_DEVICE_NAME			L"\\Device\\" DEVICE_PREFIX L"Host"
#define APPLICA_STATION_DEVICE_BASE_NAME	L"\\Device\\" DEVICE_PREFIX L"Station"
#define APPLICA_VIDEO_DEVICE_BASE_NAME		L"\\Device\\ApVid"

#define APPLICA_KEYBOARD_DEVICE_BASE_NAME	L"\\Device\\KeyboardUSBClass"
#define APPLICA_POINTER_DEVICE_BASE_NAME	L"\\Device\\PointerUSBClass"

#define APPLICA_PNP_DEVICE_BASE_NAME		L"\\Device\\" DEVICE_PREFIX L"PnP#"

#define APPLICA_BEEP_DEVICE_BASE_NAME		APPLICA_STATION_DEVICE_BASE_NAME
#define APPLICA_COMMAND_DEVICE_BASE_NAME	APPLICA_STATION_DEVICE_BASE_NAME
#define APPLICA_THINWIRE_DEVICE_BASE_NAME	APPLICA_STATION_DEVICE_BASE_NAME

#define APPLICA_STATION_BASE_NAME			DEVICE_PREFIX L"#"
#define APPLICA_STATION_NAME_LEN			16
#define APPLICA_DISPLAY_NAME_LEN			16

#define APPLICA_KEYBOARD_PORT				DEVICE_PREFIX L"KeyboardPort"
#define APPLICA_POINTER_PORT				DEVICE_PREFIX L"PointerPort"

// Definitions of Applica USB to PS/2 converters
// We use it for protection
#define APPLICA_USB_PS2_DEVICE_ENUM TEXT("USB\\VID_04B4&PID_3672")
#define APPLICA_USB_PS2_DEVICE2_ENUM TEXT("USB\\VID_0403&PID_8371")
#define APPLICA_USB_SECURE_DEVICE_ENUM TEXT("USB\\VID_08E2&PID_0006")

// Time interval for recheck USB keys
#define APPLICA_USB_RECHECK_INTERVAL		3000

// Applica DS-100 USB Docking Station
// Uses for automatically map keyboard, mouse and audio in box to one station per one click
#define APPLICA_USB_PS2_DS100_DEVICE_ENUM TEXT("USB\\VID_05E3&PID_0606")

//
// This routine does a video hardware context switch
//
typedef
VOID
(*FN_SWAP_CONTEXT)
(
	VOID
);

//
// This routine is called during a context switch to enable/disable the video hardware
//
typedef
NTSTATUS
(*FN_VIDEO)
(
	PVOID Context,
	BOOLEAN Enable
);


//
// This routine is called when an Ke386CallBios Int 10 is detected
//

typedef struct _CALL_BIOS_REG
{
	ULONG	unknown1[0x27];
	ULONG	V86EDI;
	ULONG	V86ESI;
	ULONG	V86EBX;
	ULONG	V86EDX;
	ULONG	V86ECX;
	ULONG	V86EAX;
	ULONG	V86EBP;
	ULONG	unknown2[5];
} CALL_BIOS_REG, *PCALL_BIOS_REG;


typedef
NTSTATUS
(*FN_CALL_BIOS)
(
	PVOID Context,
	PCALL_BIOS_REG Registers
);


//
// This structure registers a station command device with the host device
//
typedef struct _STATION_REGISTRATION {
	ULONG Version;					//+00
	ULONG StationId;				//+04
	APPLICA_HARDWARE_ID HardwareId;	//+08
	APPLICA_DISPLAY_ID DisplayId;	//+0C
	APPLICA_KEYBOARD_ID KeyboardId;	//+10
	APPLICA_POINTER_ID PointerId;	//+14
	ULONG Board;					//+18
	ULONG SessionId;				//+1C
	HANDLE EnableThreadId;			//+20
	HANDLE DisplayThreadId;			//+24
	HANDLE VideoThreadId;			//+28
	HANDLE PollThreadId;			//+2C	
	FN_SWAP_CONTEXT SwapContext;	//+30	
	FN_VIDEO VideoSelect;			//+34
	PVOID VideoSelectContext;		//+38
	FN_CALL_BIOS CallBios;			//+3C
	PVOID CallBiosContext;			//+40
	FN_CALL_BIOS OldCallBios;		//+44
	PVOID OldCallBiosContext;		//+48
	ULONG ProcessorAffinity;		//+4C	
	ULONG Reserved;					//+50
	UCHAR pWinstationInfo21[0x60];
} STATION_REGISTRATION, *PSTATION_REGISTRATION;


//
// This routine is called with input data
//
typedef
NTSTATUS
(*FN_INPUT)
(
	PVOID Context,
	ULONG Data
);

//
// This structure is used to register an input function
//
typedef
struct
_REGISTER_FN_INPUT
{
	FN_INPUT Function;
	PVOID Context;
	PVOID Interrupt;
	ULONG Unit;
} REGISTER_FN_INPUT, *PREGISTER_FN_INPUT;

//
// This routine is called to enable/disable the host video
//
typedef
NTSTATUS
(*FN_HOST_VIDEO)
(
	PVOID Context,
	BOOLEAN Enable
);

//
// This structure is used to register a HostVideo() function
//
typedef
struct
_REGISTER_FN_HOST_VIDEO
{
	FN_HOST_VIDEO VideoFunction;
	PVOID VideoContext;
	FN_CALL_BIOS BiosFunction;
	PVOID BiosContext;
	FN_CALL_BIOS OldCallBios;
	PVOID OldCallBiosContext;
} REGISTER_FN_HOST_VIDEO, *PREGISTER_FN_HOST_VIDEO;

//
// This structure is used to register a station's session
//
typedef
struct
_REGISTER_STATION_SESSION_ID
{
	ULONG StationId;
	ULONG SessionId;
} REGISTER_STATION_SESSION_ID, *PREGISTER_STATION_SESSION_ID;

//
// These structures are used to return a Stations PCI details
//
typedef
struct
_STATION_DISPLAY_PCI_INFO
{
	USHORT VendorId;
	USHORT DeviceId;
	ULONG BusNumber;
	ULONG SlotNumber;

	// Now some private data for station<->miniport communication
	// So we keep the structure size constant as we add new hardware we reserve 64 bytes
	// in the first member of the union.
    union {
		struct _Reserved
		{
			ULONG Data[16];				// space reserved for up to 16 DWORD
		} Reserved;
 
		struct _PCIConfig
		{
			ULONG BaseAddress[6];		// in most cases the PCI Config Base Addresses will
		} _PCIConfig;					// contain everything we need

		struct _FrameBuffer
		{
			ULONG Address;				// location and size of frame buffer
			ULONG Length;
		} FrameBuffer;

		struct _PciVga
		{
			ULONG BaseAddress;			// whatever manfred needs for Image 3D driver
			ULONG BaseAddressLength;
			ULONG IoBaseAddress;
			ULONG IoBaseAddressLength;
		} PciVga;

		struct _Image3D
		{
			ULONG BaseAddress;			// whatever manfred needs for Image 3D driver
			ULONG BaseAddressLength;
			ULONG IoBaseAddress;
			ULONG IoBaseAddressLength;
		} Image3D;

		struct _Rage2c
		{
			ULONG LfbBaseAddress;
			ULONG LfbBaseAddressLength;
			ULONG IoBaseAddress;
			ULONG IoBaseAddressLength;
			ULONG AuxBaseAddress;
			ULONG AuxBaseAddressLength;
			ULONG RomImage;
			ULONG RomImageLength;
		} Rage2c;
    } u;

} STATION_DISPLAY_PCI_INFO, *PSTATION_DISPLAY_PCI_INFO;

typedef
struct
_STATION_SOUND_PCI_INFO		// sizeof == 0xC2
{
 	USHORT VendorId;		// +0x00
	USHORT DeviceId;		// +0x02
	ULONG BusNumber;		// +0x04
	ULONG SlotNumber;		// +0x08 if bits.Reserved non-zero it contains USB PortIndex
	USHORT Wave[13];		// +0x0C
	USHORT WaveMapper[13];	// +0x26
	USHORT Midi[13];		// +0x40
	USHORT MidiMapper[13];	// +0x5a
	USHORT Joystick[13];	// +0x74
	USHORT Aux[13];			// +0x8e
	USHORT Mixer[13];		// +0xa8
} STATION_SOUND_PCI_INFO, *PSTATION_SOUND_PCI_INFO;

typedef
struct
_NEW_STATION_SOUND_PCI_INFO
{
	STATION_SOUND_PCI_INFO sspi;
	WCHAR String1[MAX_NAME_LEN]; // +0xC2
} NEW_STATION_SOUND_PCI_INFO, *PNEW_STATION_SOUND_PCI_INFO;

typedef
struct
_STATION_SOUND_USB_INFO
{
	ULONG StationId;
	WCHAR RegistryPath[MAX_NAME_LEN];
} STATION_SOUND_USB_INFO, *PSTATION_SOUND_USB_INFO;

typedef
struct
_STATION_HID_USB_INFO
{
	ULONG StationId;
	WCHAR RegistryPath[MAX_NAME_LEN];
} STATION_HID_USB_INFO, *PSTATION_HID_USB_INFO;


typedef
struct
_STATION_USB_PCI_INFO
{
	USHORT VendorId;
	USHORT DeviceId;
	ULONG BusNumber;
	ULONG SlotNumber;	// if bits.Reserved non-zero it contains USB PortIndex
} STATION_USB_PCI_INFO, *PSTATION_USB_PCI_INFO;

typedef
struct
_INIT_PCI_DEVICE
{
	ULONG BusNumber;
	ULONG SlotNumber;
	ULONG MemorySize;
	ULONG IOSize;
	ULONG MaxCards;
	ULONG status;
} INIT_PCI_DEVICE, *PINIT_PCI_DEVICE;

typedef
struct
_ALLOC_PCI
{
	ULONG BusNumber;
	BOOLEAN IoWanted;
	ULONG Size;
	ULONG BaseAddress;
} ALLOC_PCI, *PALLOC_PCI;

//
